# Brewfile for dotfiles setup
# Install with: brew bundle

# Package managers
brew "pipx"
# Note: Using Nix for reproducible development environments instead of asdf

# Core development tools
brew "git"
brew "just"
brew "tree"
brew "fzf"
brew "ripgrep"
brew "the_silver_searcher"  # ag

# Development dependencies
brew "autoconf"
brew "automake"
brew "gettext"
brew "m4"
brew "pkgconf"

# Container and virtualization tools
brew "colima"
brew "docker"
cask "docker"

# AI and productivity tools
brew "gemini-cli"

# Additional utilities
brew "readline"
brew "xz"
brew "zstd"
brew "brotli"
brew "lz4"
brew "utf8proc"
